app/Controllers/Barang.php

    public function index(): string
    {
        return view('barang/index', [
            'title'  => 'Data Barang',
            'barang' => $this->barangModel->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `barang`
ORDER BY `id` DESC

    public function store(): \CodeIgniter\HTTP\RedirectResponse
    {
        if (! $this->validate($this->rules())) {
            return redirect()->back()->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $this->barangModel->insert([
            'kode_barang' => trim((string) $this->request->getPost('kode_barang')),
            'nama_barang' => $this->request->getPost('nama_barang'),
            'satuan'      => $this->request->getPost('satuan'),
            'stok'        => (int) ($this->request->getPost('stok') ?? 0),
        ]);
---
INSERT INTO `barang` (`kode_barang`, `nama_barang`, `satuan`, `stok`, `created_at`) VALUES ('SP02', 'Sprite', 'pcs', '20', '2026-05-23 09:58:42')

    public function delete(int $id): \CodeIgniter\HTTP\RedirectResponse
    {
        if ($this->detailModel->where('barang_id', $id)->countAllResults() > 0) {
            return redirect()->to('/barang')
                ->with('error', 'Barang tidak bisa dihapus karena sudah dipakai pada transaksi.');
        }

        $this->barangModel->delete($id);
---
DELETE FROM `barang`
WHERE `id` IN (2)