app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT SUM(`stok`) AS `stok`
FROM `barang`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `jenis` = 'masuk'
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `jenis` = 'keluar'
SELECT *
FROM `barang`
WHERE `stok` <= 10
ORDER BY `stok` ASC
SELECT `t`.*, `b`.`nama_barang`, `b`.`satuan`
FROM `transaksi` `t`
JOIN `barang` `b` ON `b`.`id` = `t`.`barang_id`
ORDER BY `t`.`id` DESC
 LIMIT 8
---
    public function index(): string
    {
        $db = \Config\Database::connect();

        $totalBarang      = $this->barangModel->countAll();
        $totalStok        = $db->table('barang')->selectSum('stok')->get()->getRow()->stok ?? 0;
        $totalMasuk       = $db->table('transaksi')->where('jenis', 'masuk')->countAllResults();
        $totalKeluar      = $db->table('transaksi')->where('jenis', 'keluar')->countAllResults();

        $barangKritis     = $this->barangModel
                               ->where('stok <=', 10)
                               ->orderBy('stok', 'ASC')
                               ->findAll();

        $transaksiTerbaru = $db->table('transaksi t')
            ->select('t.*, b.nama_barang, b.satuan')
            ->join('barang b', 'b.id = t.barang_id')
            ->orderBy('t.id', 'DESC')
            ->limit(8)
            ->get()
            ->getResultArray();