app/Controllers/Transaksi.php

SELECT *
FROM `barang`
---
    public function create(): string
    {
        $data = [
            'title'  => 'Tambah Transaksi',
            'barang' => $this->barangModel->findAll(),

SELECT *
FROM `barang`
WHERE `barang`.`id` = 2
INSERT INTO `transaksi` (`kode_transaksi`, `barang_id`, `jenis`, `jumlah`, `keterangan`, `tanggal`) VALUES ('TRX-20260419-001', 2, 'keluar', 100, 'Pembelian Toko Uye', '2026-04-19')
---
    public function store(): \CodeIgniter\HTTP\RedirectResponse
    {
        $barangId = (int) $this->request->getPost('barang_id');
        $jenis    = $this->request->getPost('jenis');
        $jumlah   = (int) $this->request->getPost('jumlah');

        // Validasi stok cukup saat keluar
        if ($jenis === 'keluar') {
            $barang = $this->barangModel->find($barangId);
            if ($barang['stok'] < $jumlah) {
                return redirect()->back()->withInput()
                    ->with('error', "Stok tidak cukup! Stok tersedia: {$barang['stok']} {$barang['satuan']}");
            }
        }

        // Simpan transaksi
        $this->transaksiModel->insert([
            'kode_transaksi' => $this->request->getPost('kode_transaksi'),
            'barang_id'      => $barangId,
            'jenis'          => $jenis,
            'jumlah'         => $jumlah,
            'keterangan'     => $this->request->getPost('keterangan'),
            'tanggal'        => $this->request->getPost('tanggal'),
        ]);

SELECT *
FROM `transaksi`
WHERE `transaksi`.`id` = 1
DELETE FROM `transaksi`
WHERE `id` IN (1)
---
    public function delete(int $id): \CodeIgniter\HTTP\RedirectResponse
    {
        $transaksi = $this->transaksiModel->find($id);

        // Balikkan efek stok sebelum hapus
        $this->rollbackStok($transaksi['barang_id'], $transaksi['jenis'], $transaksi['jumlah']);

        $this->transaksiModel->delete($id);

SELECT *
FROM `barang`
WHERE `barang`.`id` = 2
UPDATE `barang` SET `stok` = 200
WHERE `barang`.`id` IN (2)
---
    private function updateStok(int $barangId, string $jenis, int $jumlah): void
    {
        $barang = $this->barangModel->find($barangId);
        $stokBaru = $jenis === 'masuk'
            ? $barang['stok'] + $jumlah
            : $barang['stok'] - $jumlah;

        $this->barangModel->update($barangId, ['stok' => max(0, $stokBaru)]);