app/Models/AdminModel.php

    public function findByUsername(string $username): array|null
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1