app/Models/BarangModel.php

SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `kode_barang` = 'SP02'
---
    public function isKodeTaken(string $kode, ?int $excludeId = null): bool
    {
        $builder = $this->where('kode_barang', $kode);
        if ($excludeId) {
            $builder = $builder->where('id !=', $excludeId);
        }
        return $builder->countAllResults() > 0;

SELECT `b`.*, `k`.`nama_kategori`, `s`.`nama_satuan`, `s`.`singkatan`, `sp`.`nama_supplier`, `g`.`nama_gudang`, COALESCE(NULLIF(s.singkatan, ''), s.nama_satuan) AS satuan
FROM `barang` `b`
LEFT JOIN `kategori` `k` ON `k`.`id` = `b`.`kategori_id`
LEFT JOIN `satuan` `s` ON `s`.`id` = `b`.`satuan_id`
LEFT JOIN `supplier` `sp` ON `sp`.`id` = `b`.`supplier_id`
LEFT JOIN `gudang` `g` ON `g`.`id` = `b`.`gudang_id`
ORDER BY `b`.`id` DESC
---
    public function getAllWithRelations(): array
    {
        return $this->selectWithRelations()
            ->orderBy('b.id', 'DESC')
            ->get()
            ->getResultArray();

SELECT `b`.*, `k`.`nama_kategori`, `s`.`nama_satuan`, `s`.`singkatan`, `sp`.`nama_supplier`, `g`.`nama_gudang`, COALESCE(NULLIF(s.singkatan, ''), s.nama_satuan) AS satuan
FROM `barang` `b`
LEFT JOIN `kategori` `k` ON `k`.`id` = `b`.`kategori_id`
LEFT JOIN `satuan` `s` ON `s`.`id` = `b`.`satuan_id`
LEFT JOIN `supplier` `sp` ON `sp`.`id` = `b`.`supplier_id`
LEFT JOIN `gudang` `g` ON `g`.`id` = `b`.`gudang_id`
WHERE b.stok <= b.stok_minimum
ORDER BY `b`.`stok` ASC
---
    public function getCriticalStock(): array
    {
        return $this->selectWithRelations()
            ->where('b.stok <= b.stok_minimum', null, false)
            ->orderBy('b.stok', 'ASC')
            ->get()
            ->getResultArray();