app/Models/TransaksiDetailModel.php

SELECT `td`.*, `b`.`kode_barang`, `b`.`nama_barang`, COALESCE(NULLIF(s.singkatan, ''), s.nama_satuan) AS satuan
FROM `transaksi_detail` `td`
JOIN `barang` `b` ON `b`.`id` = `td`.`barang_id`
LEFT JOIN `satuan` `s` ON `s`.`id` = `b`.`satuan_id`
WHERE `td`.`transaksi_id` IN (2,1)
ORDER BY `td`.`id` ASC
---
    public function getGroupedByTransaksiIds(array $transaksiIds): array
    {
        $transaksiIds = array_values(array_filter(array_map('intval', $transaksiIds)));

        if ($transaksiIds === []) {
            return [];
        }

        $rows = $this->db->table($this->table . ' td')
            ->select('td.*, b.kode_barang, b.nama_barang')
            ->select("COALESCE(NULLIF(s.singkatan, ''), s.nama_satuan) AS satuan", false)
            ->join('barang b', 'b.id = td.barang_id')
            ->join('satuan s', 's.id = b.satuan_id', 'left')
            ->whereIn('td.transaksi_id', $transaksiIds)
            ->orderBy('td.id', 'ASC')
            ->get()
            ->getResultArray();