app/Models/TransaksiModel.php

SELECT `t`.*, `b`.`nama_barang`, `b`.`kode_barang`, `b`.`satuan`
FROM `transaksi` `t`
JOIN `barang` `b` ON `b`.`id` = `t`.`barang_id`
ORDER BY `t`.`id` DESC
---
    public function getAllWithTotals(): array
    {
        return $this->selectWithTotals()
            ->orderBy('t.id', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `jenis` = 'masuk'
---
    public function countByJenis(string $jenis): int
    {
        return $this->where('jenis', $jenis)->countAllResults();