app/Models/TransaksiModel.php

    public function generateKode(): string
    {
        $prefix = 'TRX-' . date('Ymd') . '-';
        $last   = $this->like('kode_transaksi', $prefix, 'after')
                       ->orderBy('id', 'DESC')
                       ->first();
---
SELECT *
FROM `transaksi`
WHERE `kode_transaksi` LIKE 'TRX-20260419-%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1